{
  "recommend": [
    "25","8","2"
  ],
  "index_recommend": [
    "33","34","35"
  ],
  "news": [
        {
          "id": "35",
          "title": "LayaAir Case: NetDragon produces LOL (League of Legends) IP 3D mini game -Decisive Battle of the Giants-!",
          "date": "2019-09-28",
          "brief": "On the occasion of the tenth anniversary of the upcoming tenth anniversary, NetDragon has launched this WeChat game, the battle of the heroes of the League of Legends, which has a generation of youth and faith. It is different from the traditional LOL game. In the version, -Decisive Battle of the Giants- uses a casual climbing tower game.",
          "jpgpath": "2019/09/28/img/load.jpg",
          "filepath": "2019/09/28/readme.md"
        },     {
          "id": "34",
          "title": "LayaAir engine 3D pinch face dressup game case -Taobao Life- and -Heart Trainer-",
          "date": "2019-09-27",
          "brief": "The pinch face dressup game, there is no shortage of well-known explosive masterpieces in the APP game, this type has always been a popular game type. In the field of HTML5 and small games, technical support, whether it is custom vertices and custom shaders or PBR and 3D bone support, LayaAir engine is enough to ensure that the game achieves APP native performance.",
          "jpgpath": "2019/04/28/layabox.png",
          "filepath": "2019/09/27/readme.md"
        }, 
    {
          "id": "33",
          "title": "The LayaAir engine abandons the Canvas API, creating the next generation 3D engine and cloud game engine, providing AI empowerment!",
          "date": "2019-04-28",
          "brief": "LayaAir engine gives up the Canvas native API, it does not mean giving up 2D, but for better development of 2D and 3D! In the future, the LayaAir engine will maintain the optimization and stability of 2D, focusing on the development of the next generation 3D engine. For the ultimate pursuit of technology, we have never stopped!",
          "jpgpath": "2019/09/27/img/4.png",
          "filepath": "2019/04/28/readme.md"
        }, 
    {
          "id": "32",
          "title": "Layabox launches LayaMaker, a programming-free 3D production tool, and joins the elite education group to enter new areas!",
          "date": "2019-04-26",
          "brief": "Layabox signed a strategic cooperation agreement with UUabc, an elite education leader in education, and announced that it has officially entered the interactive teaching field of the education industry with its product, LayaMaker. LayaMaker users can quickly create beautifully crafted 3D interactive scenes without the need for a programming foundation.",
          "jpgpath": "2019/04/26/img/0.jpg",
          "filepath": "2019/04/26/readme.md"
        }, 
    {
          "id": "31",
          "title": "Layabox is the first to support Xiaomi fast game, LayaAir 2.0.2 version greatly enhances 3D performance, spine performance and memory optimization, new screen adaptation settings!",
          "date": "2019-04-15",
          "brief": "During this time, we not only added a large number of LayaAir 2.0 3D documents on the official website, but also optimized some 2D documents and completely updated the 3D examples of the official website. In the LayaAir 2.0.2 beta version, we also made a lot of updates around the main points of the 2.0 engine development -performance, ease of use, 3D-, and it is the first to complete the engine adaptation of the Xiaomi fast game. The release of the Xiaomi Express game is integrated in the LayaAir IDE.",
          "jpgpath": "2019/04/15/img/qgame.png",
          "filepath": "2019/04/15/readme.md"
        }, 
    {
          "id": "30",
          "title": "MOBA, SLG, ARPG, FPS type 3D HTML5 game case boutique recommendation",
          "date": "2019-03-11",
          "brief": "3D products using the LayaAir engine in WeChat games and HTML5, according to the small series known more than 300 models, 3D engine (H5 and small games) accounted for more than 90%. I will not introduce casual games today, and recommend several different types of high-quality 3D game case masterpieces.",
          "jpgpath": "2019/03/11/img/moba.jpg",
          "filepath": "2019/03/11/readme.md"
        }, 
    {
          "id": "29",
          "title": "LayaAir 2.0 official version released, a comprehensive introduction to important features",
          "date": "2019-01-19",
          "brief": "It lasted for more than 4 months and launched 4 2.0 beta versions, including several bug fixes, 2D engine and IDE optimization and new features, and 3D engine and plug-in optimization and new features. Under the unremitting efforts of the engine team, the developer finally got a stable version of 2.0.",
          "jpgpath": "2019/01/19/img/3.png",
          "filepath": "2019/01/19/readme.md"
        }, 
{
      "id": "28",
      "title": "LayaAir engine 3D games re-exposed 60 models, small game engine accounted for 93% in November",
      "date": "2018-12-11",
      "brief": "Although the total amount of 3D games is still much lower than that of 2D games, the growth rate of 3D games is far more than the explosive growth of 2D games. In these 3D games, the vast majority of 3D games are LayaAir engine products, accounting for more than 93% of the 3D engine in small games.",
      "jpgpath": "2018/12/11/img/2.png",
      "filepath": "2018/12/11/readme.md"
    }, 
{
      "id": "27",
      "title": "Baidu is about to launch a smart game, Layabox is the first to complete engine adaptation support!",
      "date": "2018-11-26",
      "brief": "Baidu's small game first covered the mobile phone Baidu APP with 160 million user traffic, and officially launched its efforts in the small game industry. As the leading engine manufacturer, Layabox has taken the lead in adapting the engine to Baidu games, and integrated the release of Baidu games in LayaAirIDE, providing a new platform bonus for the current 500,000 LayaAir engine developers. opportunity!",
      "jpgpath": "2018/11/26/banner.jpg",
      "filepath": "2018/11/26/readme.md"
    }, 
{
      "id": "26",
      "title": "Layabox helps developers quickly access QQ light games and enjoy the traffic bonus!",
      "date": "2018-11-5",
      "brief": "QQ light gaming platform users have exceeded 250 million. Layabox is based on the advantages of QQ light game technology and business, and proposes a distribution cooperation model to help many developers with technical pressure and confusion, quickly solve technical and business problems, and enjoy the traffic opportunities of QQ light games.",
      "jpgpath": "2018/11/5/img/2.jpg",
      "filepath": "2018/11/5/readme.md"
    }, 
{
      "id": "25",
      "title": "Layabox launches a small game traffic sharing platform, and developers can get game traffic for free!",
      "date": "2018-11-1",
      "brief": "The developer only realizes the technical docking by dragging and dropping. Simply submitting the game information, you can self-join the small game traffic sharing platform, thus achieving free access to traffic! As the operator and initiator of the traffic sharing platform, Layabox will never charge any fees and share of developers participating in the traffic sharing platform. It aims to build a free shared ecology of -I am for everyone, everyone is for me-.",
      "jpgpath": "2018/11/1/img/0.png",
      "filepath": "2018/11/1/readme.md"
    }, 
{
      "id": "24",
      "title": "-Tencent Billiards- live 3 million daily! Count 3D games for the LayaAir engine!",
      "date": "2018-05-18",
      "brief": "Tencent billiards is a competitive battle game based on real players online matching developed by Tencent Photon Studio. It uses the 3D technology of LayaAir engine to truly restore the texture of the billiards and the sense of movement in the sport. Once launched, it is well received by the majority of players. favorite. It is understood that the current cumulative number of users has exceeded 15 million, and daily active users have exceeded 3 million.",
      "jpgpath": "2018/05/18/1.png",
      "filepath": "2018/05/18/readme.md"
    }, 
{
      "id": "23",
      "title": "Against the sky! 3D webpage display can be so embarrassing!",
      "date": "2018-02-11",
      "brief": "This is a non-gaming HTML5 web page that is based on 3D space technology and switches between different floating islands. By clicking on the GO, you can enter each scene, view the island in 360 degrees, and perform some simple interactive operations.",
      "jpgpath": "2018/02/11/9.jpg",
      "filepath": "2018/02/11/readme.md"
    }, 
{
      "id": "22",
      "title": "Science fiction theme HD free viewing angle 3D H5 game -Space Mech- today deleted file test",
      "date": "2018-01-26",
      "brief": "The game's model uses high-resolution 3D rendering, high-texture and high-definition textures, whether it is 2K screen or 4K screen, all exhibit high-definition character quality. Its new 360-degree horizontal rotation free-view function restores true 3D stereoscopic images, which is the first time in the H5 industry.",
      "jpgpath": "2018/01/26/2.jpg",
      "filepath": "2018/01/26/readme.md"
    }, 
{
      "id": "21",
      "title": "WeChat Open Class: Summary of all the essence of WeChat games!",
      "date": "2018-01-15",
      "brief": "In the 2018 WeChat open class, WeChat games have undoubtedly become one of the most important hot spots. This article summarizes the main content of the WeChat game related to the WeChat open class in the morning and the small game sub-forum in the afternoon.",
      "jpgpath": "2018/01/15/0.jpg",
      "filepath": "2018/01/15/readme.md"
    },
      {
      "id": "20",
      "title": "The -WeChat Small Game- platform was officially released, and the LayaAir engine synchronized support for WeChat games!",
      "date": "2017-12-28",
      "brief": "On December 28th, WeChat games were released online in version 6.6.1. Through the WeChat small game platform entered by WeChat applet, you can see the first 15 game products, 4 of which are developed by LayaAir engine and released by the small program adapter library provided by Layabox.",
      "jpgpath": "2017/12/28/img/1.jpg",
      "filepath": "2017/12/28/readme.md"
    },
    {
      "id": "19",
      "title": "Layabox Xie Chenghong attended the TFC and announced that the intelligent optimization solution can improve performance by 2 times!",
      "date": "2017-10-28",
      "brief": "Layabox has always impressed a batch of R&D teams with performance advantages. However, the LayaAir engine team, which pursues the highest performance, is not satisfied with this and is still continually optimizing. For example, for the UI and game scenarios, the LayaAir engine team will launch a new intelligent optimization solution.",
      "jpgpath": "2017/10/28/1.png",
      "filepath": "2017/10/28/readme.md"
    },
    {
      "id": "18",
      "title": "The most profitable H5 game -Angel's Sword H5- is open for 24 days.",
      "date": "2017-10-27",
      "brief": "On October 22nd, the -Dragon's Sword H5- on the line for 24 days announced that the water was broken. The game was created by the listed company Sanqi Mutual Entertainment (002555.SZ), and was jointly issued by Sanqi Mutual Entertainment and Fingers. Since then, H5 games have finally entered the era of billions of waters, which will make the whole game The industry is invigorated.",
      "jpgpath": "2017/10/27/1.png",
      "filepath": "2017/10/27/readme.md"
    },
    {
      "id": "17",
      "title": "Tencent's first self-developed HTML5 game -All the big people- WeChat, mobile QQ synchronous beta",
      "date": "2017-08-05",
      "brief": "On August 3, Tencent's self-developed fighting HTML5 game -All the Great People- was launched on the Android version of WeChat and mobile QQ. The game uses the LayaAir engine, developed by Tencent Mirror Studio. As the first online self-developed HTML5 turn-based game launched by Tencent, the launch of -All People's Big Game- marks that Tencent's self-research team has officially entered the HTML5 game field.",
      "jpgpath": "2017/08/05/1.jpg",
      "filepath": "2017/08/05/readme.md"
    },
    {
      "id": "16",
      "title": "Layabox Xie Chenghong: 2017 is the year of HTML5 solid foundation",
      "date": "2017-07-29",
      "brief": "At 14:00 on July 28th, 2017, Butterfly Interactive and Layabox jointly held a large-scale HTML5 industry gathering with the theme of “Boutique Age, Open and Win-win” at Shanghai Mook Bar. More than 500 H5 game makers, media and channels participated in the party. Layabox CEO Xie Chenghong attended and delivered a speech.",
      "jpgpath": "2017/07/29/1.png",
      "filepath": "2017/07/29/readme.md"
    },
    {
      "id": "15",
      "title": "-Snow Eagle Lord 3D- yesterday Tencent play it! HTML5 enters the era of 3D games!",
      "date": "2017-07-22",
      "brief": "Under the performance guarantee of the LayaAir engine, I believe that as more and more 3D R&D vendors join, 3D explosion products may appear in the near future. At least in the moment, the launch of -Snow Eagle Lord 3D- marks a new milestone in 3D HTML5 games, and is also driving HTML5 into the era of 3D games.",
      "jpgpath": "2017/07/22/1.jpg",
      "filepath": "2017/07/22/readme.md"
    },
    {
      "id": "14",
      "title": "LayaBox Xie Chenghong thinks about the 2017 HTML5 industry!",
      "date": "2017-01-17",
      "brief": "2017 is a year of HTML5 game design, but for many people, HTML5 games are new, but not new opportunities. Factors such as the lack of quality products and the rush of channels will affect the rhythm of the development of HTML5 games, and some people will not be able to achieve the expected revenue. Those who are slow, speculators, and those who lack capacity will lose a huge opportunity.",
      "jpgpath": "2017/01/17/0.png",
      "filepath": "2017/01/17/readme.md"
    },
    {
      "id": "13",
      "title": "Burberry launched Wu Yifan's New Year's advertisement in the WeChat circle of friends, using the LayaAir engine!",
      "date": "2017-01-11",
      "brief": "Recently, the Burberry New Year advertisement, a luxury brand developed by Shanghai Bianco using the LayaAir engine, appeared in the WeChat circle of friends and became a hot spot. Although the LayaAir engine originated in the game field, it also supports software development, advertising marketing, and life services.",
      "jpgpath": "2017/01/11/0.png",
      "filepath": "2017/01/11/readme.md"
    },
    {
      "id": "12",
      "title": "LayaBox won the 2016 H5 Industry Contribution Award",
      "date": "2017-01-10",
      "brief": "On January 10, 2017, the 6th “Jinpeng Award” China Original Game Selection Competition Awarding Ceremony, co-hosted by Colorful Interactive and Global Network, co-organized by UCCVR, LayaBox relies on two aspects of HTML5 game technology innovation and quality products. Contributed to the -H5 Industry Contribution Award of the Year-",
      "jpgpath": "2017/01/10/0.png",
      "filepath": "2017/01/10/readme.md"
    },
    {
      "id": "11",
      "title": "The WeChat IOS client is fully upgraded to the WKWebview kernel, and HTML5 performance will be increased by 4 times!",
      "date": "2017-01-06",
      "brief": "After comparing the performance test links of the technical brothers, the difference between the performance of the current WeChat kernel UIWebView and Safari's WKWebview kernel is about 4 times. Memory usage can be reduced by about 30%. Performance improvements and memory footprint reductions are a big plus for developers of HTML5 large games, and future HTML5 games can easily achieve the effects of APP games.",
      "jpgpath": "2017/01/06/0.jpg",
      "filepath": "2017/01/06/readme.md"
    },
    {
      "id": "10",
      "title": "LayaBox Xie Chenghong and Li An, Jay Chou, Tu Yu and other famous creative figures 100",
      "date": "2017-01-03",
      "brief": "On December 30th, 2016, the internationally renowned business magazine Fast Company Chinese version of -Fast Company- held an award ceremony for -2016 China's most creative business people-. Among them, the HTML5 game field entered the selection for the first time, and LayaBox founder Xie Chenghong won the -2016 China Business Most Creative Character 100-",
      "jpgpath": "2017/01/03/0.png",
      "filepath": "2017/01/03/readme.md"
    },
    {
      "id": "9",
      "title": "HTML5 industry's first 3D ARPG game -Endless Knight- exposure, HTML5 into the 3D era?",
      "date": "2016-12-09",
      "brief": "After the channel is shuffled, quality HTML5 games will usher in more opportunities. Looking at the development of APP games, the 3D game era will dominate the future. Can HTML5 technology carry 3D games? The HTML5 industry's first 3D ARPG game, The Endless Knight, will open the answer for us.",
      "jpgpath": "2016/12/09/0.jpg",
      "filepath": "2016/12/09/readme.md"
    },
    {
      "id": "8",
      "title": "[cross-border TALK] programmer's passion and dream LayaBox CEO Xie Chenghong",
      "date": "2016-10-24",
      "brief": "I used to sell websites to earn tens of millions, and I made a loss of over 100 million in end-games. Today, LayaBox A has raised 100 million yuan. Xie Chenghong, who has been in business for 20 years, is going to be the world's top game engine. Xie Chenghong, CEO of LayaBox: -As a programmer, I want to create something that belongs to me through the way of the program, change something that affects some worlds.-",
      "jpgpath": "2016/10/24/0.jpg",
      "filepath": "2016/10/24/readme.md"
    },
    {
      "id": "7",
      "title": "Xie Chenghong attended the TFC: The cross-border three-end is an opportunity for the game industry!",
      "date": "2016-09-28",
      "brief": "On September 27th, the 13th TFC Global Pan Games Conference and Intelligent Entertainment Exhibition was officially opened at Guangzhou Nanfeng International Convention and Exhibition Center. The theme of this conference was “Transboundary, Integration and Breakthrough”, bringing together hundreds of ideas and insights. . LayaBox CEO Xie Chenghong was invited to attend the conference and gave a keynote speech on -The Cross-Bound Three Ends, H5 and the Future- on the status quo and future trends of the game industry in the main forum.",
      "jpgpath": "2016/9/28/0.jpg",
      "filepath": "2016/9/28/readme.md"
    },
    {
      "id": "6",
      "title": "Depth test: LayaAir H5 game engine bare running performance surpasses Unity3D",
      "date": "2016-08-18",
      "brief": "This article verifies the actual performance of the LayaAir H5 game engine by analyzing the actual evaluation report data one by one. Each evaluation DEMO will provide the H5 direct experience QR code, as well as the Unity3D engine's APP source code and the recorded HD video network disk download address for the developer's actual test experience and verification to ensure the true validity of this test report.",
      "jpgpath": "2016/8/18/0.jpg",
      "filepath": "2016/8/18/readme.md"
    },
    {
      "id": "5",
      "title": "LayaAir1.0 conference: not only H5, but also a game change",
      "date": "2016-06-30",
      "brief": "On June 30th, well-known engine manufacturer LayaBox held its second-generation engine LayaAir 1.0 release conference at the Beijing International Convention Center, officially releasing the 1.0 version of the LayaAir game engine for the world. More than 20 game circles in the field, more than 50 media, and more than 300 industry insiders witnessed a breakthrough in China's HTML5 (hereafter referred to as H5) technology.",
      "jpgpath": "2016/6/30/0.jpg",
      "filepath": "2016/6/30/readme.md"
    },
    {
      "id": "4",
      "title": "Entrepreneurship first public class, Xie Chenghong was invited to give a speech: mobile game IP value",
      "date": "2016-06-25",
      "brief": "On June 24th, the first public class of “Innovation Space DEMO SPACE” held by Entrepreneurship was held in Shanghai. Layabox President Xie Chenghong, well-known science fiction writer Ji Yuming and “100,000 Jokes” film director Lu Hengyu were invited to participate in this open class. . Discuss together -how to give IP a set of sustainable world views.-",
      "jpgpath": "2016/5/26/0.jpg",
      "filepath": "2016/5/26/readme.md"
    },
    {
      "id": "3",
      "title": "HTML5 technology becomes the new favorite of campus Layabox engine enters the university classroom",
      "date": "2016-05-26",
      "brief": "On May 25th, 2016, Layabox, one of the three major H5 game engine companies in China, was invited to enter the Beijing Institute of Technology to bring a technology feast for H5 technology to the students. Li Ming, a partner of Layabox, has aroused great interest among students through the interpretation of the current status and future development of the H5 industry, the analysis of H5 employment prospects, the in-depth analysis of engine technology, and the guidance and recommendations of learning methods.",
      "jpgpath": "2016/5/26/0.jpg",
      "filepath": "2016/5/26/readme.md"
    },
    {
      "id": "2",
      "title": "Interview with Xie Chenghong, founder of Layabox: Let Chinese HTML5 technology stand on the top of the world",
      "date": "2016-04-19",
      "brief": "The Layabox engine, which has won many awards such as the HTML5 Best Engine Award and the HTML5 Industry Contribution Award, has many unknown secret weapons behind it. TechWeb reporters have the honor to interview Layabox, a legendary entrepreneurial experience. Founder Xie Chenghong, he will unveil the story behind the HTML5 engine technology.",
      "jpgpath": "2016/4/19/0.jpg",
      "filepath": "2016/4/19/readme.md"
    },
    {
      "id": "1",
      "title": "LayaAir, the king of H5 engine performance, is released today, and HTML5 will enter the era of heavy boutiques.",
      "date": "2016-04-15",
      "brief": "After repeated testing and running in a number of large H5 games and over 100 H5 developers. On April 15th, Layabox's second-generation H5 engine LayaAir was officially opened for download. Compared to the previous generation engine, LayaAir has made overall optimizations in terms of performance, API, toolchain, etc., smaller, faster, and stronger! It is also a super H5 engine that can be separated from the H5 runtime plug-in (runtime) and the performance is comparable to that of the APP.",
      "jpgpath": "2016/4/15/0.jpg",
      "filepath": "2016/4/15/readme.md"
    }
  ]
}

